let dropdown = document.getElementById("dropdown");
let menuBtn = document.getElementById("menuBtn");
let menuContent = document.getElementById("menuContent");

function dropdownActive(e) {
    e.stopPropagation();
    menuContent.classList.add("active");
    menuBtn.style.backgroundColor = '#AD974F';
};

menuContent.addEventListener("click", (e) => {
    e.stopPropagation();
});

document.addEventListener("click", () => {
    menuContent.classList.remove("active");
    menuBtn.style.backgroundColor = '#231F20';
});


let foodList = document.getElementById("foodList");

let FoodlistHome = [
    {id: 1, name: "ต้มยำกุ้ง", image: "tomyumkung.jpg"
        ,desc: 'ต้มยำกุ้ง เป็นอาหารไทยภาคกลางประเภทต้มยำ ซึ่งเป็นที่นิยมรับประทานไปทุกภาคในประเทศไทย เป็นอาหารที่รับประทานกับข้าว มีรสเปรี้ยวและเผ็ดเป็นหลักผสมเค็มและหวานเล็กน้อย',
        material: ['กุ้ง', 'ข่า ตะไคร้ ใบมะกรูด', 'พริกขี้หนู', 'พริกจินดา', 'น้ำพริกเผา', 'นมสด', 'น้ำปลา', 'น้ำตาล', 'มะนาว' ,'หอมแดง' ,'ผักชีฝรั่ง' ,'เห็ด'], 
        amount: ['6 ขีด', '1 มัด', '10 เม็ด', '7 เม็ด', '1 ช้อน', '7 ช้อน', '2 ช้อน', '1 ช้อน', '2 ช้อน', '6 หัวเล็ก', 'แล้วแต่ชอบ','แล้วแต่ชอบ'], 
        sol: ['นำกุ้งมาปลอกเปลือกและผ่าหลังเอาเส้นดำๆออก', 'เอาข่า ตะไคร้ ใบมะกูดมาล้างให้สะอาด แล้วหั่นเตรียมไว้', 'ปลอกหอมแดงแล้วนำมาล้างให้สะอาดแล้วนำไปทุบให้แตกเล็กน้อย', 'ล้างพริกให้สะอาด แล้วเอาพริกจินดามาตำให้แหลก','ผักชีฝรั่งล้างสะอาดแล้วนำมาซอย','หั่นเห็ดและนำมาล้างให้สะอาด','น้ำ 400 ml ตั้งไฟให้เดือดจากนั่นใส่ ข่า ตะไคร้ ใบมะกูด หอมแดง ต้มสักพักแล้วแล้วใส่เห็ดลงไป พอเดือดตามด้วยกุ้ง', 'กุ้งเริ่มออกสีแดงก้อเริ่มปรุงรสกันเลย ใส่พริกเผา 1 ช้อน นมสด 7 ช้อน แล้วตามด้วยใส่พริกแล้วแต่ชอบเผ็ดมากเผ็ดน้อย ตามด้วยน้ำปลา 2 ช้อน น้ำตาล 1 ช้อน น้ำมะนาว 2 ช้อน ชิมตามรสชาติที่ชอบ โรยด้วยพริกขี้หนูและผักชีฝรั่ง']
    },
    {id: 2, name: "ผัดไทย", image: "padthai.png"
        ,desc: 'ผัดไทย เมนูสตรีทฟู้ดสู่เมนูระดับโลก สูตร ผัดไทยกุ้งสด มาพร้อมเทคนิค การย่างกุ้งให้หอม สูตรน้ำซอสผัดไทย เพื่อคุมรสชาติให้คงที่เท่ากันทุกจาน อร่อยเข้มข้น เครื่องแน่น ๆ เส้นไม่ให้ติดกัน ทำตามง่ายมาก',
        material: ['กุ้งสด', 'เต้าหู้แข็ง', 'ไข่ไก่', 'ใบกุยช่าย', 'หอมแดงซอย', 'กุ้งแห้ง หรือกุ้งฝอย', 'ไชโป๊วเค็ม', 'เส้นจันท์', 'ถั่วลิสงคั่ว' ,'ถั่วงอก' ,'มะนาว' ,'พริกป่น','น้ำมันพืช (สำหรับผัด)' ,'ผงชูรส' ,'น้ำตาลปี๊บ' ,'น้ำมะขามเปียก' ,'น้ำเปล่า' ,'น้ำปลา'], 
        amount: ['5 ตัว', '1/4 ก้อน', '1 ฟอง', '1 หยิบมือ', '4 หัว', '1 ช้อนชา', '1 ช้อนโต๊ะ', '100 กรัม', '1 ช้อนโต๊ะ', '1 หยิบมือ', '1 ลูก','1 ช้อนชา','2 ช้อนโต๊ะ','1/4 ช้อนชา','25 กรัม','30 กรัม','20 กรัม','20 กรัม'], 
        sol: ['เคี่ยวน้ำตาลปี๊บ น้ำมะขามเปียก น้ำปลา น้ำเปล่า และผงชูรส จนละลาย เป็นซอสเข้มข้น ประมาณ 5 นาที ปิดเตา พักเตรียมไว้', 'นำเส้นจันท์ ไปแช่น้ำ ทิ้งไว้ประมาณ 15 นาที เตรียมไว้', 'ตั้งกระทะให้ร้อน ใส่น้ำมันพืชเล็กน้อย พอน้ำมันร้อน ใส่กุ้งสดลงไปย่าง จนกุ้งเริ่มสุก ตักขึ้นใส่จาน เตรียมไว้', 'ใช้กระทะใบเดิมที่ย่างกุ้ง ผัดเต้าหู้ หอมแดง ให้เข้ากัน และใส่เส้นจันท์เข้ากันเบา ๆ แล้วใช้ตะหลิวเขี่ยเส้นไปไว้ข้างกระทะ จากนั้น ตอกไข่ไก่ลงไป ผัดให้เข้ากัน','จากนั้น ใส่น้ำซอสผัดไทยผัดให้เข้ากันจนเส้นเหนียวนุ่มดี และใส่กุ้งแห้ง หรือกุ้งฝอย ไชโป๊วเค็ม กุ้งย่าง และใส่ถั่วงอก ใบกุยช่าย ผัดให้เข้ากัน ปิดเตา','ตักผัดไทยใส่จาน วางกุ้งตกแต่งไว้ด้านบน เสิร์ฟพร้อมผัดสด ถั่วลิสงคั่วบด พริกป่น และมะนาว พร้อมทาน']
    },
    {id: 3, name: "ส้มตำไทยไข่เค็ม", image: "tumthai.jpg"
        ,desc: ' ไข่เค็มกินกับข้าวต้มแสนจะจืดชืด จับมาทำเมนูส้มตำไทยไข่เค็มเพิ่มความแซ่บดีกว่า อร่อยเด็ดที่กุ้งแห้งและถั่วคั่ว ยิ่งถ้าได้ไข่แดงเค็มเป็นน้ำมันเยิ้ม ๆ ออกมาละก็ฟินสุดใจเลยล่ะ',
        material: ['มะละกอสับ', 'ไข่เค็ม', 'มะเขือเทศ', 'พริกขี้หนู', 'กระเทียม', 'น้ำตาลปี๊บ', 'ถั่วฝักยาว', 'น้ำปลา', 'น้ำมะนาว' ,'กุ้งแห้ง' ,'ถั่วลิสง'], 
        amount: ['แล้วแต่ชอบ', '1 ฟอง', '3 ลูก', 'แล้วแต่ชอบ', '1 ช้อนโต๊ะ', '2 ช้อนชา', '2 ฝัก', '4 ช้อนโต๊ะ', '4 ช้อนโต๊ะ', '1 ช้อนโต๊ะ', '1 ช้อนโต๊ะ'], 
        sol: ['โขลกพริก กระเทียม น้ำตาลปี๊บ และถั่วฝักยาวพอแหลก', '​ใส่ไข่เค็มลง 1/2 ฟอง​ (​ที่เหลือเอาไว้​เสิร์ฟ) ตามด้วยมะเขือเทศกับกุ้งแห้ง', 'ปรุงรสด้วยน้ำปลากับน้ำมะนาว คลุกส่วน​ผ​สมให้เข้ากัน ใส่มะละกอลงไป โขลกพอเข้ากัน ตักใส่จาน โรยกุ้งแห้ง ถั่วลิสง ​และไข่เค็ม']
        
    },
    {id: 4, name: "เต้าหู้ไข่ลูกเขย", image: "tofu.png"
        ,desc: 'เต้าหู้ไข่ลูกเขย เมนูอาหารไทยสุดคลาสสิกที่มาพร้อมน้ำราดหอมกลิ่นมะขามเป็นเอกลักษณ์ เต้าหู้ไข่นุ่ม ๆ รสชาติอมเปรี้ยวอมหวานกลมกล่อม เข้ากับเต้าหู้ไข่ชุบแป้งทอดผิวกรอบ ๆ หนึบ ๆ โรยด้วยหอมเจียวยิ่งฟิน!',
        material: ['เต้าหู้ไข่ไก่', 'แป้งทอดกรอบสำเร็จรูป', 'นํ้าเย็นจัด', 'นํ้ามันพืช', 'น้ำตาลปี๊บ', 'นํ้าปลา', 'นํ้ามะขามเปียก', 'หอมแดงเจียว', 'พริกขี้หนูแห้งทอด' ,'ผักชี' ,'ต้นหอม'], 
        amount: ['3 หลอด', '90 กรัม', '100 มิลลิลิตร', '1 ช้อน', '1 ถ้วย', '1 ถ้วย', '3 ช้อนโต๊ะ', '1/3 ถ้วย', '1/2 ถ้วย', 'สำหรับตกแต่ง','สำหรับตกแต่ง'], 
        sol: ['หั่น เต้าหู้ไข่ไก่ ตราเอโร่ เป็นแว่น กดเป็นรูปหัวใจ ใส่จานพักไว้ ละลายแป้งทอดกรอบกับนํ้าเย็นจัด คนให้ละลายเข้ากัน', 'ตั้งกระทะนํ้ามันบนไฟกลางจนร้อน ใส่เต้าหู้ชุบแป้งลงทอดจนสุกเหลืองทั่ว ตักขึ้นใส่จาน พักไว้', 'ตักนํ้ามันในกระทะที่ทอดเต้าหู้ออกให้เหลือประมาณ 2 ช้อนโต๊ะ ใส่นํ้าตาลปี๊บลงเคี่ยวด้วยไฟอ่อนจนนํ้าตาลละลาย ใส่นํ้าปลาและนํ้ามะขามเปียก คนพอทั่ว เคี่ยวต่อให้มีลักษณะข้นเหนียวเล็กน้อย ชิมให้ได้รสเปรี้ยวหวานและเค็ม ปิดไฟ', 'จัดเต้าหู้ทอดใส่จาน ราดนํ้าซอสมะขามที่เคี่ยวไว้ โรยหอมแดงเจียวและพริกขี้หนูแห้งทอด ตกแต่งด้วยผักชีและต้นหอมซอยให้สวยงาม พร้อมเสิร์ฟ']
        
    },
    {id: 5, name: "บานอฟฟี่พายคาราเมล", image: "banoffee.jpg"
        ,desc: 'บานอฟฟี่ ภาษาอังกฤษ Banoffee มาจากคำว่า Banana (กล้วย) กับ Toffee (คาราเมล) ตัวฐานทำจากแครกเกอร์ บิสกิต หรือคุกกี้บดเคล้าผสมเนยหอม ๆ เค็ม ๆ ตามด้วยส่วนที่เป็นซอสทอฟฟี่คาราเมล กล้วยหอม และวิปครีม มีทั้งแบบใส่ในถ้วย ในแก้ว ในโหล หรือแบบปอนด์ เป็นอีกหนึ่งสูตรขนมที่ไม่ต้องใช้เตาอบ และทำง่ายสุด ๆ',
        material: ['นมข้นหวาน', 'น้ำเปล่า', 'โอรีโอ้', 'เนยเค็ม', 'กล้วยหอม', 'วิปปิ้งครีม', 'ผงโกโก้'], 
        amount: ['1 กระป๋อง', 'ตามเหมาะสม', '13 ชิ้น (26 ฝา)', '100 กรัม', '2-3 ลูก', '130 กรัม', 'ตามความชอบ'], 
        sol: ['ทำคาราเมล โดยใส่กระป๋องนมข้นหวานลงในหม้อแล้วเทน้ำเปล่าลงไปพอให้ท่วมกระป๋อง เปิดไฟต้มประมาณ 2-2.30 ชั่วโมง (ถ้าน้ำต้มลดลงให้เติมน้ำ) [แนะนำว่าให้ทำคาราเมลเตรียมไว้ล่วงหน้า 1 วัน]', 'ปาดเอาครีมระหว่างฝาของโอรีโอ้ออก บดโอรีโอ้ให้ละเอียด', 'ละลายเนยด้วยไมโครเวฟ ใช้เวลาประมาณ 40 วินาที ถ้าเนยยังไม่ละลายให้คนต่ออีกประมาณ 20 วินาที', 'ผสมเนยละลายกับโอรีโอ้บด คนผสมจนเข้ากันดี','เทใส่พิมพ์ที่สามารถถอดก้นได้','เทคาราเมลส่วนหนึ่งลงบนโอรีโอ้ครัสต์ปริมาณมากน้อยตามชอบ','วางกล้วยหอมทับลงไป เทคาราเมลที่เหลือปิดทับบนหน้ากล้วยหอมอีกรอบ','ตีวิปปิ้งครีมจนตั้งยอดแข็ง บีบวิปปิ้งครีมลงไป ตกแต่งให้สวยงาม', 'โรยผงโกโก้และนำไปแช่ในตู้เย็นอีกสัก 1-2 ชั่วโมง พร้อมรับประทาน']
        
    },
    {id: 6, name: "เค้กกล้วยหอม", image: "banana.jpg"
        ,desc: ' เค้กกล้วยหอมจัดเป็นอาหารสำเร็จรูปที่สะดวกสบายทั้งในการหาซื้อและการพกพาและยังสามารถเก็บไว้ได้นานเค้กกล้วยสามารถทำเองได้ง่ายๆเพราะมีส่วนผสมไม่มากนักหาซื้อได้ตามท้องตลาดทั่วไปส่วนวิธีการทำนั้นไม่ยากเลยไม่ต้องใช้อุปกรณ์อะไรมากก็สามารถทำขนมเค้กกล้วยหอมทานเองได้ง่ายๆ',
        material: ['กล้วยหอมสุกบด', 'น้ำมะนาว', 'น้ำตาลทราย', 'แป้งเค้ก', 'ผงฟู', 'เบกกิ้งโซดา', 'เกลือ', 'น้ำมันพืช', 'กลิ่นวานิลลา' ,'ไข่ไก่' ,'ท็อปปิ้ง'], 
        amount: ['200 กรัม', '1 ช้อนชา', '180 กรัม', '200 กรัม', '1+1/2 ช้อนชา', '1 ช้อนชา', '1/2 ช้อนชา', '1 ถ้วย', '1 ช้อนชา', '3 ฟอง','ตามความชอบ'], 
        sol: ['บดกล้วยหอมให้ละเอียดและบีบน้ำมะนาวลงไป คนให้เข้ากัน', 'นำไข่และน้ำตาลใส่โถตี ตีด้วยความเร็วสูงสุดประมาณ 8 นาที จนขึ้นฟู หลังครบเวลาจะได้เนื้อเบทเทอร์ที่ข้น พักไว้','ผสมแป้งเค้ก ผงฟู เกลือ และเบกกิ้งโซดา เข้าด้วยกัน', 'ร่อนส่วนผสมแป้งใส่ลงชามเบทเทอร์ ตีผสมให้เข้ากันจนแป้งไม่เป็นเม็ดสีขาว', 'ใส่กลิ่นวานิลลาและน้ำมัน ตีผสมให้เข้ากัน','ใส่กล้วยที่บดไว้ ตีต่อส่วนผสมทั้งหมดเข้ากันดี ตักใส่พิมพ์','โรยหน้าด้วยท็อปปิ้งตามชอบ ในภาพโรยด้วยอัลมอนด์สไลซ์กับลูกเกดค่ะ','นำเข้าอบที่อุณหภูมิ 200 องศาเซลเซียส ประมาณ 25-30 นาที']
        
    },
    {id: 7, name: "ซอฟคุกกี้", image: "softck.png"
        ,desc: 'ซอฟคุกกี้ เหมาะมากสำหรับมือใหม่หัดอบ เพราะทำง่าย อร่อย แถมดูดี โพสอวดเพื่อนได้ วัตถุดิบสำคัญที่ทำให้คุกกี้นิ่ม หนึบหนับ ก็คือน้ำตาลทรายแดง ตัดหวานด้วยดาร์กช็อกโกแลตเข้มๆ 70%',
        material: ['แป้งสาลีอเนกประสงค์', 'เนยสดชนิดเค็ม (ละลาย)', 'น้ำตาลทรายแดง', 'น้ำตาลทรายขาว', 'ไข่ไก่ (เบอร์ 2)', 'กลิ่นวานิลลา', 'เบกกิ้งโซดา', 'ผงฟู', 'ดาร์กช็อกโกแลต' ,'ไวท์ช็อกโกแลต'], 
        amount: ['260 กรัม', '130 กรัม', '120 กรัม', '70 กรัม', '1 ฟอง', '1 ช้อนชา', '1 ช้อนชา', '1/2 ช้อนชา', '60 กรัม','60 กรัม'], 
        sol: ['ตั้งกระทะเปิดไฟอ่อน ใส่เนยสดชนิดเค็มลงไปบนกระทะ ค่อย ๆ คนจนเนยละลายดี ปิดเตาพักเตรียมไว้',
            'นำดาร์กช็อกโกแลตและไวท์ช็อกโกแลตมาสับให้เป็นชิ้นเล็ก ๆ เตรียมไว้',
            'ใส่น้ำตาลทรายขาว น้ำตาลทรายแดง และเนยที่ละลายไว้ ในชามตีผสมด้วยตะกร้อมือ',
            'ใส่ไข่ไก่ และกลิ่นวานิลลา ตีผสมให้เข้ากัน ตามด้วยนำแป้งสาลีอเนกประสงค์ เบกกิ้งโซดา และผงฟู ร่อนลงตามไปในชาม และใช้พายค่อย ๆ ตะล่อมส่วนผสมให้เข้ากัน',
            'นำดาร์กช็อกโกแลต และไวท์ช็อกโกแลตที่สับไว้ ใส่ลงไปในแป้งที่ผสมไว้ ใช้พายยางตะล่อมให้ส่วนผสมเข้ากัน',
            'นำแป้งคุกกี้โดว์ พักไว้ในตู้เย็นประมาณ 1 ชั่วโมง เมื่อพักแป้งครบเวลาแล้ว นำแป้งซอฟคุกกี้ มาปั้นเป็นก้อนกลม ๆ ขนาด 70 กรัม พร้อมใส่ดาร์กช็อกโกแลต และไวท์ช็อกโกแลตลงไปตรงกลางของคุกกี้ จากนั้น ค่อย ๆ ใช้มือปั้นห่อแป้ง ซอฟคุกกี้ ให้มิด',
            'นำไปวางเรียงบนถาดอบขนม ที่รองด้วย กระดาษไขรองอบ โดยเว้นระยะห่างของคุกกี้โดว์แต่ละชิ้น ประมาณ 4 นิ้ว',
            'นำซอฟคุกกี้ที่เรียงในถาด ใส่เข้าใน เตาอบ convection จากนั้นอบ ซอฟคุกกี้ช็อกโกแลตชิพ ที่อุณหภูมิ 170 องศาเซลเซียส ประมาณ 15 นาที จนซอฟคุกกี้สุก',
            'เมื่อครบเวลา นำ ซอฟคุกกี้ช็อกโกแลตชิพ ออกจากเตา และจัดเรียงใส่จาน จัดเสิร์ฟพร้อม นมสด หรือ ชา กาแฟ ตามชอบ พร้อมทาน']
        
    },
    {id: 8, name: "เค้กเรดเวลเวต", image: "redvelvet.png"
        ,desc: 'เค้กเรดเวลเวต คือเค้กที่มีสีแดงเข้ม แดงอ่อน หรือสีน้ำตาลแดง แต่เดิมคือเค้กแซนด์วิชที่ตกแต่งด้านบนด้วยครีมชีส หรือรู (roux) ปรุงสำเร็จโรยหน้าเค้ก สีแดงในเค้ก เดิมทีแล้วมาจากการใส่น้ำส้มสายชู (วิธีสมัยใหม่จะเพิ่มส่วนผสมของบีตรูต หรือสีผสมอาหาร)',
        material: ['ผงฟู', 'เกลือ', 'สีผสมอาหาสีแดงสด', 'กลิ่นวานิลลา', 'เอสพี (สารเสริมคุณภาพ)', 'ผงโกโก้', 'น้ำตาลทรายเบเกอรี่', 'ไข่ไก่ (เบอร์ 2)', 'นมสด' ,'เนยสด(ละลาย)' ,'นมข้นจืด' ,'แป้งเค้ก','น้ำส้มสายชู', 'เนยจืด', 'ครีมชีส', 'น้ำมะนาว','น้ำตาลไอซิ่ง'], 
        amount: ['2 ช้อนชา', '1/4 ช้อนชา', '1 ช้อนโต๊ะ', '2 ช้อนชา', '15 กรัม', '20 กรัม', '90 กรัม', '3 ฟอง', '60 กรัม', '90 กรัม', '60 กรัม','135 กรัม', '10 กรัม', '195 กรัม','375 กรัม','25 กรัม', '1/8 ช้อนชา', '200 กรัม'], 
        sol: ['ตอกไข่ ลงไปในโถตีแป้ง ตามด้วย นมข้นจืด นมสด เกลือ และกลิ่นวานิลลา จากนั้น ร่อนของแห้ง เช่น แป้งเค้ก ผงฟู ตามด้วย ใส่น้ำตาลทราย เอสพี ตีด้วยหัวตะกร้อ ใช้ความเร็วเบอร์ 1 ตีจนแป้งยุบตัวดี เมื่อส่วนผสมเข้ากันได้ที่ เริ่มใช้ความเร็วแรงสุดได้ ตีจนส่วนผสมเข้ากัน ประมาณ 5-7 นาที ตียาว ๆ ได้เลย', 'ผสมผงโกโก้ กับ น้ำส้มสายชู คนให้เข้ากัน และเติมสีผสมอาหารสีแดง คนจนเข้ากันดี และนำไปเทในส่วนผสมแป้งที่ตีไว้ก่อนหน้า', 'ตีส่วนผสมด้วยความเร็วแรงสุด จนเนื้อแป้งเนียนเป็นสีแดง ลดความเร็วลงให้อยู่ปานกลาง ค่อย ๆ เติมเนยละลาย ลงไป ตีจนเข้ากันดี ปิดเครื่อง เตรียมไว้', 'เตรียมถาดอบขนม รองด้วยกระดาษไข จากนั้น นำเนื้อเค้ก เทลงบนถาดขนม ปาดเนื้อเค้กให้เข้ามุมถาด นำเค้กเข้าเตาอบ ตั้งอุณภูมิไว้ ไฟบน 170°C ไฟล่าง 180°C อบประมาณ 15-20 นาที','ใส่ครีมชีส เนยจืด ลงในโถตีแป้ง ใช้หัวใบพายในการตีผสม ใช้ความเร็วระดับกลาง ตีจนส่วนผสมเข้ากัน เติมน้ำตาลไอซิ่งลงไป ตีจนเนื้อเนียนสวย ประมาณ 10 นาที ปรุงรสด้วย น้ำมะนาว ตีต่อให้เข้ากัน ตักใส่ถุงบีบ เตรียมไว้','นำเนื้อเค้กที่พักไว้ให้เย็นแล้วมากลับด้านเนื้อเค้ก ลอกกระดาษไขรองอบออก นำพิมพ์รูปหัวใจมากดลงบนเนื้อเค้ก ทำจนครบ ส่วนเนื้อเค้กที่เหลือจากการตัด ให้นำไปบดเป็นผง เพื่อเตรียมโรยหน้าเค้ก ตกแต่งเค้ก','โดยนำเค้กแผ่นที่ 1 วางลงไป บีมครีมชีสลงไปจนเต็ม จากนั้นวางเค้กแผ่นที่ 2 ตามลงไป บีมครีมชีสลงไปให้เต็ม', 'ตกแต่งด้วยเนื้อเค้กบด ใบไทม์ และแผ่นทอง โรยหน้าตามชอบ จัดเรดเวลเวทเค้กใส่จาน เสิร์ฟพร้อมเครื่องดื่มร้อน-เย็น พร้อมทาน']
        
    },
    {id: 9, name: "พอร์คพิคคาตาราดมีทซอส", image: "piccata.png"
        ,desc: 'พอร์คพิคคาตาราดมีทซอส จากเรื่อง campfire cooking in another world with my absurd skill เป็นหมูสันนอกชิ้นบางๆ นำมาชุบแป้งและไข่ นำไปทอดจนสุด ราดด้วยมีทซอสสูตรพิเศษ',
        material: ['ไข่ไก่', 'พาร์มีซานชีส', 'พาร์สเลย์แห้ง', 'สันนอกหมูสไลซ์', 'น้ำมันพืช', 'แป้งสาลีอเนกประสงค์', 'เกลือป่นและพริกไทยดำป่น', 'ผักสลัด', 'หอมใหญ่สับหยาบ', 'เนื้อวัวบด', 'ใบกระวานแห้ง', 'ซอสมะเขือเทศกระป๋อง', 'ซุปก้อนหมูหรือไก่', 'น้ำ'], 
        amount: ['2 ฟอง', '1/4 ถ้วย', '1 ช้อนชา', '300 กรัม', '3 ช้อนโต๊ะ', 'สำหรับคลุกหมู', 'สำหรับปรุงรส','สำหรับจัดเสิร์ฟ','1 หัว', '100 กรัม', '2 ใบ', '1 กระป๋อง', '1/2 ก้อน', '1 ถ้วย'], 
        sol: ['ทำมีทซอสโดยตั้งกระทะน้ำมันพืชบนไฟกลาง พอร้อนใส่หอมใหญ่ลงผัดจนหอมใหญ่มีสีน้ำตาลอ่อนๆ ใส่เนื้อวัว ผัดพอสุก จากนั้นใส่ใบกระวานแห้ง ซอสมะเขือเทศกระป๋อง ซุปก้อนและน้ำ เคี่ยวจนส่วนผสมงวด ใช้เวลาประมาณ 15 นาที เตรียมไว้', 'ตอกไข่ใส่อ่างผสม ตามด้วยพาร์มีซานชีส และพาร์สเลย์ ตีให้ไข่และชีสเข้ากันดี เตรียมไว้', 'นำหมูสันนอกใส่ถาด ปรุงรสด้วยเกลือและพริกไทย โรยแป้งสาลีอเนกประสงค์ให้ทั่ว เคาะแป้งส่วนเกินออก จากนั้นตั้งกระทะน้ำมันพืชบนไฟกลางพอร้อน นำหมูชุบไข่ ลงไปทอดจนหมูสุกและสีสวยดี ทำจนหมด ตักขึ้นพักไว้', 'จัดเสิร์ฟโดยวางผัดสลัดหัวจาน เรียงหมูทอดใส่จาน ราดด้วยมีทซอส เสิร์ฟ']
        
    },
    {id: 10, name: "แซลมอนทอดแบบเมอนิแยร์", image: "salmon.png"
        ,desc: 'meunière เมอนิแยร์ คืออาหารปรุงอาหารประเภทปลา ที่เป็นการนำเนื้อปลามาคลุกแป้งบางๆ ก่อนนำไปย่าง มักจะเสิร์ฟกับเลมอนซอส หรือซอสอื่นๆ แต่วันนี้เราจะเสิร์ฟกับซอสทาร์ทาร์สไตล์ญี่ปุ่น เพราะได้ไอเดียมาจากอนิเมะเรื่อง campfire cooking in another world with my absurd skill',
        material: ['แซลมอนฟิลเลย์', 'น้ำมันพืช', 'แป้งสาลีอเนกประสงค์', 'เกลือป่นและพริกไทยดำป่น', 'เลมอนหั่นเสี้ยวและผักสลัด', 'ไข่ต้มสับหยาบ', 'หอมใหญ่สับละเอียด', 'มายองเนส', 'มัสตาร์ด' ,'น้ำมะนาว' ,'ผักชีลาวซอย' ,'เกลือป่นและพริกไทยดำป่น'], 
        amount: ['3 ชิ้น 300 กรัม', '2 ช้อนโต๊ะ', 'ตามเหมาะสม', 'สำหรับปรุงรส', 'สำหรับจัดเสิร์ฟ', '1 ฟอง', '2 ช้อนโต๊ะ', '1/2 ถ้วย', '1 ช้อนชา', '1 ช้อนชา', '1/2 ช้อนโต๊ะ','สำหรับปรุงรส'], 
        sol: [' ทำซอสทาร์ทาร์โดยใส่ไข่ต้มและหอมใหญ่ลงในอ่างผสม ปรุงรสด้วยมายองเนส มัสตาร์ด น้ำมะนาว เกลือและพริกไทยคนให้เข้ากัน ใส่ผักชีลาวซอยคนให้เข้ากันอีกครั้งพักไว้', 'นำแซลมอนเรียงใส่ในถาด ปรุงรสเกลือและพริกไทยเล็กน้อย โรยแป้งสาลีอเนกประสงค์ให้ทั่ว เคาะแป้งส่วนเกินออก เตรียมไว้ จากนั้นตั้งกระทะน้ำมันบนไฟกลาง พอร้อนนำแซลมอนลงอย่างด้านละ 2-3 นาที จนแซลมอนสุกและสีสวย ตักขึ้นพักไว้', 'จัดเสิร์ฟโดยวางผัดสลัดหัวจาน วางแซลมอน ราดด้วยซอสทาร์ทาร์ เสิร์ฟคู่กับเลมอนหั่นเสี้ยว เสิร์ฟ']
        
    },
    {id: 11, name: "แฮมเบิร์กเนื้อไส้ชีส", image: "cheese.png"
        ,desc: 'แฮมเบิร์กเนื้อไส้ชีส จากเรื่อง campfire cooking in another world with my absurd skill ซึ่งเป็นเมนูที่ใคร ๆ ก็รู้จักกันดี แต่วันนี้แอดวานซ์ขึ้นด้วยการยัดไส้ชีส และมีเครื่องเคียงถึง 2 อย่างด้วยกัน',
        material: ['น้ำมันพืช', 'หอมใหญ่สับละเอียด', 'เกล็ดขนมปัง', 'นมสดชนิดจืด', 'เนื้อวัวบด', 'ไข่ไก่', 'ชีสแผ่น', 'น้ำ', 'ซอสมะเขือเทศ' ,'วูสเตอร์ซอส' ,'น้ำตาลทรายขาว' ,'เกลือป่น', 'มันฝรั่งหั่นเสี้ยว', 'มันฝรั่งหั่นแท่งเล็กๆ', 'แป้งสาลีอเนกประสงค์', 'น้ำมันพืชสำหรับทอด'], 
        amount: ['3 ช้อนโต๊ะ', '1/2 หัว', '1/2 ถ้วย', '1/4 ถ้วย', '400 กรัม', '1/2 ฟอง', '4 แผ่น', '1/2 ถ้วย', '4 ช้อนโต๊ะ', '1 ช้อนโต๊ะ', '1 ช้อนโต๊ะ','1/2 ช้อนชา', '1 ลูก 300กรัม', '1 ลูก 300กรัม', '1/4 ถ้วย', 'ตามเหมาะสม'], 
        sol: ['ทำมันฝรั่งทอดตั้งหม้อน้ำบนไฟกลางพอเดือด นำมันฝรั่งหั่นเสี้ยวลงต้ม ใช้เวลาต้มประมาณ 5-10 นาที ให้มันฝรั่งพอสุก ตักขึ้นพักบนตะแกรงให้สะเด็ดน้ำ พักไว้', 'นำมันฝรั่งหั่นแท่งเล็กสับให้แห้ง มาคลุกแป้งสาลีอเนกประสงค์เตรียมไว้ จากนั้นตั้งกระทะบนไฟกลางค่อนอ่อนพอร้อน ใส่นำมันฝรั่งหั่นแท่งเล็กๆ ลงทอด ใช้เวลาประมาณ 15 นาที ตักขึ้นพักให้สะเด็ดน้ำมัน นำมันฝรั่งหั่นเสี้ยวที่พักไว้มาทอดต่อในกระทะใบเดิม เร่งไฟเป็นไฟกลาง ทอดจนสีเหลืองสวย ใช้เวลาประมาณ 5 นาที ตักขึ้นพักให้สะเด็ดน้ำมัน', 'ตั้งกระทะบนไฟกลาง ใส่น้ำมัน 1 ช้อนโต๊ะ พอน้ำมันร้อน นำหอมใหญ่ลงผัด ผัดหอมใหญ่จนสุก และมีสีน้ำตาลอ่อนตักขึ้นพักไว้ให้เย็น นำเกล็ดขนมปังใส่อ่างผสม เติมนมสดลงไป แช่ไว้ประมาณ 5 นาที จนเกล็ดขนมปังดูดซึมนมสดดี พักไว้', 'ทำแฮมเบิร์กโดยนำเนื้อวัวบดใส่ในอ่างผสม ตามด้วยหอมใหญ่ผัด เกล็ดขนมปังนมสด ไข่ไก่ ปรุงรสด้วยเกลือและพริกไทยตามชอบ ใช้มือนวดส่วนผสมให้เข้ากันดี ปิดพลาสติกแรปนำเข้าแช่ตู้เย็นช่องธรรมดา 15-20 นาที ครบเวลานำออกมาปั้นเป็นก้อน ให้ได้ 4 ก้อนเท่าๆกัน ใส่ชีสลงตรงกลาง ปั้นเป็นก้อนทรงกลมแบน (ให้เนื้อแฮมเบิร์กคลุมชีสดี) เรียงใส่ถาด แช่ในช่องแข็ง 10 นาที เพื่อให้เซ็ตตัว','ตั้งกระทะบนไฟกลาง ใส่น้ำมันพืชที่เหลือ พอน้ำมันร้อน ใส่แฮมเบิร์กลงย่างด้านละ 2 นาที เติมน้ำ ¼ ถ้วย ปิดฝาอบในกระทะประมาณ 10 นาที ครบเวลาตักขึ้นพักไว้ จากนั้นทำซอสแฮมเบิร์กโดยใส่ซอสมะเขือเทศ วูสเตอร์ซอส น้ำตาลทรายขาวและเกลือป่นในกระทะที่ใช้ย่างเนื้อ เติมน้ำอีก ¼ ถ้วยที่เหลือ คนให้เข้ากัน ต้มพอเดือด','จัดเสิร์ฟแฮมเบิร์กโดยวางมันฝรั่งทอด และเนื้อแฮมเบิร์กลงบนจาน ราดซอสบนเนื้อ เสิร์ฟ']
        
    },
    {id: 12, name: "พิซซ่าญี่ปุ่นโอโคโนมิยากิ", image: "pizza.png"
        ,desc: 'พิซซ่าญี่ปุ่นโอโคโนมิยากิ เป็นแพนเค้กคาวที่ทำจากแป้งสาลีผสมกะหล่ำปลีซอย, ไข่, และส่วนผสมที่ชอบ (เช่น หมู, อาหารทะเล) นำมาทอดบนกระทะแล้วราดด้วยซอสโอโคโนมิยากิ, มายองเนส, โรยสาหร่ายและปลาแห้ง',
        material: ['น้ำเปล่า', 'คัตสึโอะคาชิสำเร็จรูป', 'แป้งสาลีอเนกประสงค์', 'ผงฟู', 'เกลือป่น', 'ไข่ไก่', 'หอมหัวใหญ่ซอย', 'กะหล่ำปลีซอย', 'ปูอัด' ,'มายองเนส' ,'ซอสโอโคโนมิยากิ' ,'ผงปลาโอแห้ง สาหร่าย'], 
        amount: ['175 มิลลิลิตร', '3 กรัม', '100 กรัม', '1 ช้อนชา', '1 ช้อนชา', '2 ฟอง', '1/2 หัว', '1/2 หัว', 'แล้วแต่ชอบ', 'แล้วแต่ชอบ', 'แล้วแต่ชอบ','แล้วแต่ชอบ'], 
        sol: ['เทผงคัตสึโอะคาชิลงในน้ำที่เตรียมไว้ จากนั้นนำเข้าไมโครเวฟ 1-2 นาที คนให้เข้ากัน พักไว้', 'เทแป้งสาลีอเนกประสงค์ลงชามผสม ตามด้วย ผงฟู และเกลือป่น คนผสมให้เข้ากัน', 'จากนั้นค่อยๆ เทน้ำจากผงคัตสึโอะลงไปในแป้ง ค่อยๆ คนให้ทุกอย่างเข้ากันดี', 'ตามด้วยไข่ไก่ คนจนทุกอย่างเข้ากัน ใส่หัวหอมและกะหล่ำปลีลงไป คลุกเคล้าให้เข้ากัน ใส่ปูอัดตามชอบ','ตั้งกระทะ ใส่น้ำมันเล็กน้อย เทแป้งที่ผสมไว้ลงไป กดให้แบนทั่วกระทะ จากนั้นปิดฝาไว้','กลับแป้งอีกด้านให้สุกเท่ากัน ปิดฝาอบไว้ ตัดออกมาเป็นขนาดทรงกลม','ราดซอสมายองเนสและซอสโอโคโนมิยากิ ตามชอบ ท็อปด้วยสาหร่ายและปลาโอแห้งด้านบน เป็นอันเสร็จ']
        
    },
];

for (let i=0; i < FoodlistHome.length; i++){
    foodList.innerHTML += `
    <div class="card">
    <div class="centered">
    <h2>${FoodlistHome[i].name}</h2><button class="viewbtn"><a href="#${FoodlistHome[i].id}">ดูสูตรอาหาร</a></button>
    </div>
    <div class="hoverimg"></div>
    <img src="images/${FoodlistHome[i].image}" alt="tomyumkung" width="300px" height="200px">
    </div>`
}

let start = document.getElementById("start");
for (let i=0; i < FoodlistHome.length; i++){
    start.innerHTML += `<section id="${FoodlistHome[i].id}" class="page">
                <div class="card_food">
                    <div>
                        <h2>${FoodlistHome[i].name}</h2>
                    </div>
                    <div class="layout">
                        <div class="lay-1">
                            <div class="img-resize">
                                <img src="images/${FoodlistHome[i].image}" alt="">
                            </div>
                            <p class="desc">${FoodlistHome[i].desc}</p>
                        </div>
                        <div class="mat">
                            <h4>ส่วนผสม</h4><div class="mat1"><table class="table" id="mat${FoodlistHome[i].id}"></table></div>
                            
                        </div>
                        <div class="solve">
                            <h4>ขั้นตอนการทำ</h4>
                            <ol class="s-ol" id="solve${FoodlistHome[i].id}"></ol>
                        </div>
                    </div>
                </div>
            </section>`
}

FoodlistHome.forEach((mate) => {
    let mat = document.getElementById('mat'+[mate.id]);
    for (let i = 0; i < mate.material.length; i++){
        let tr = document.createElement('tr');
        let td = document.createElement('td');
        td.appendChild(document.createTextNode(mate.material[i]));
        tr.appendChild(td);
        td = document.createElement('td');
        td.appendChild(document.createTextNode(mate.amount[i]));
        tr.appendChild(td);
        mat.appendChild(tr);
    }
});


FoodlistHome.forEach((s) => {
    let solve = document.getElementById('solve'+[s.id]);
    for (let i = 0; i < s.sol.length; i++){
        let li = document.createElement('li');
        li.appendChild(document.createTextNode(s.sol[i]));
        solve.appendChild(li);
    }

});
